
## Plan Result




<pre><code>Plan: 0 to add, 6 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.app_insights_key
  * azurerm_key_vault_secret.civil_db_password__v11_secret
  * azurerm_key_vault_secret.civil_docmosis_api_key
  * azurerm_key_vault_secret.civil_s2s_secret
  * azurerm_key_vault_secret.sendgrid_api_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "app_mi"  {
      ~ client_id           = "653cff27-c594-40eb-a730-fef9789931d2" -> (known after apply)
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/civil-aat-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "civil-aat-mi"
      ~ principal_id        = "05abbb96-02f6-4611-86b3-397bfe745479" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
          - "application"         = "civil"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_key_vault_secret.app_insights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://civil-aat.vault.azure.net/secrets/appinsights-instrumentation-key/aca746bd1b464f1c89302103cb08b4f9"
        name                    = "appinsights-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "appinsights civil-service-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.civil_db_password__v11_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "civil_db_password__v11_secret" {
        id                      = "https://civil-aat.vault.azure.net/secrets/cmc-db-password-v11/104382c198464ff28f00f157009bf543"
        name                    = "cmc-db-password-v11"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Vault cmc-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.civil_docmosis_api_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "civil_docmosis_api_key" {
        id                      = "https://civil-aat.vault.azure.net/secrets/docmosis-api-key/7afd565869d7440da2e7028826da64ae"
        name                    = "docmosis-api-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Vault et-cos-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.civil_s2s_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "civil_s2s_secret" {
        id                      = "https://civil-aat.vault.azure.net/secrets/microservicekey-civil-service/43a8f3ebe9944be4878454a0966a5416"
        name                    = "microservicekey-civil-service"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Vault s2s-aat"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sendgrid_api_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sendgrid_api_key" {
        id                      = "https://civil-aat.vault.azure.net/secrets/sendgrid-api-key/b962ed15d3474a1580a748365b2779e0"
        name                    = "sendgrid-api-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-service.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "Vault sendgridnonprod"
        }
        # (7 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-service-aat/providers/Microsoft.KeyVault/vaults/civil-aat|civil-aat"
      - log_analytics_destination_type = "AzureDiagnostics" -> null
        name                           = "civil-aat"
        # (2 unchanged attributes hidden)


      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (1 unchanged block hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2060,"Program":"tfcmt","SHA1":"","Vars":{}} -->